---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IntegerParameterValue Properties
IntegerParameterValue Class See Also Send Feedback
---

The IntegerParameterValue type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from ParameterValue.) |
|  | Value | The stored value |

# See Also

IntegerParameterValue Class

Autodesk.Revit.DB Namespace